app/controllers/groups_controller.rb

SELECT "groups".* FROM "groups"
SELECT "groups".* FROM "groups" INNER JOIN "memberships" ON "memberships"."group_id" = "groups"."id" WHERE (memberships.user_id=1)
---
  def index
    @groups     = policy_scope(Group)
    @group      = Group.new
    @yam_groups = Yammer::GetAllGroups.new(current_user).call
    @yam_groups = @yam_groups.select do |group|
      Membership.joins(:group).where('groups.full_name = ? and memberships.user_id = ? and memberships.user_in_dash = true', group[:full_name], current_user.id).empty?

INSERT INTO "groups" ("rse_group_id", "rse_network_id", "full_name", "web_url", "mugshot_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT  1 AS one FROM "memberships" WHERE "memberships"."group_id" IS NULL AND "memberships"."user_id" = 1 LIMIT $1  [["LIMIT", 1]]
---
  def create
    yam_groups            = Yammer::GetAllGroups.new(current_user).call
    group_params_from_api = yam_groups.find do |yam_group|
      yam_group[:full_name] == params[:group][:full_name]
    end
    if Group.where('full_name = ?', group_params_from_api[:full_name]).empty?
      @group = current_user.groups.build(group_params_from_api)
      authorize @group
      @group.save
      # Yammer::UpdateGroup.new(current_user, @group).call
    else
      @group = Group.where('full_name = ?', group_params_from_api[:full_name]).first
      authorize @group
    end

    if Membership.where('user_id = ? and group_id = ?', current_user.id, @group.id).empty?

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def find_group
    @group = Group.find(params[:id])